app/controllers/items_controller.rb

INSERT INTO `items` (`title`, `user_id`, `shelf_id`, `file`, `download`, `preview`, `preview_path`, `format`, `created_at`, `updated_at`) VALUES ('hero-book-covers.jpg', 1, 1, '/var/host/media/removable/Storage/LyBerry/public/uploads/Robert/hero-book-covers.jpg', 'uploads/Robert/hero-book-covers.jpg', 'uploads/Robert/previews/hero-book-covers.jpg.jpg', '/var/host/media/removable/Storage/LyBerry/public/uploads/Robert/previews/hero-book-covers.jpg.jpg', 'image/jpeg', '2017-01-07 01:22:33', '2017-01-07 01:22:33')
---
  def create
    require 'fileutils'
    @item = Item.new(item_params)
    uploaded_io = params[:item][:file]
    dir = Rails.root.join('public', 'uploads', current_user.name)
    FileUtils::mkdir_p dir

    @item.download = File.join("uploads",current_user.name,uploaded_io.original_filename)
    @item.file = dir.join(uploaded_io.original_filename)
    @item.title = uploaded_io.original_filename
    @item.user_id = current_user.id
    @item.format = uploaded_io.content_type
    @item.shelf_id = params[:item][:shelf_id]
    @item.preview = File.join("uploads", current_user.name, "previews", File.basename(@item.title)+".jpg")
    @item.preview_path = File.join(dir, "previews", File.basename(@item.title)+".jpg")
    File.open(@item.file, 'wb') do |file|
      file.write(uploaded_io.read)
    end
    @item.get_preview(200)

    respond_to do |format|
      if @item.save

DELETE FROM `items` WHERE `items`.`id` = 1
---
  def destroy
    @item.destroy

SELECT  `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1
---
    def set_item
      @item = Item.find(params[:id])