app/controllers/notebooks_controller.rb

  def index
    @notebooks = Notebook.all
---
SELECT `notebooks`.* FROM `notebooks`

  def show
    @notes = Note.where("notebook_id = ?", @notebook.id )
---
SELECT `notes`.* FROM `notes` WHERE (notebook_id = 2)

  def create
    @notebook = Notebook.new(notebook_params)
    @notebook.user_id = current_user.id
    @notebook.preview = File.join(current_user.folder_path, 'previews', @notebook.title+".jpg")
    @notebook.download = File.join(current_user.folder_download, "previews", @notebook.title+".jpg")
    @notebook.get_cover
    respond_to do |format|
      if @notebook.save
---
INSERT INTO `notebooks` (`title`, `shelf_id`, `user_id`, `cover`, `cover_download`, `created_at`, `updated_at`) VALUES ('Marketing', 1, 1, '/var/host/media/removable/Storage/LyBerry/public/uploads/Robert/previews/Marketing.jpg', '/uploads/Robert/previews/Marketing.jpg', '2017-01-08 22:47:23', '2017-01-08 22:47:23')

  def destroy
    @notebook.destroy
---
DELETE FROM `notebooks` WHERE `notebooks`.`id` = 1

    def set_notebook
      @notebook = Notebook.find(params[:id])
---
SELECT  `notebooks`.* FROM `notebooks` WHERE `notebooks`.`id` = 1 LIMIT 1