app/controllers/notes_controller.rb

  def index
    @notes = Note.all
---
SELECT `notes`.* FROM `notes`

  def new
    @note = Note.new
    @notebook_options = []
    Notebook.where("user_id = ?", current_user.id).each do |notebook|
---
SELECT `notebooks`.* FROM `notebooks` WHERE (user_id = 1)

  def create
    @note = Note.new(note_params)
    @note.user_id = current_user.id
    @note.notebook_id = params[:notebook]
    @note.preview = File.join(current_user.folder_path, "previews", Notebook.find(@note.notebook_id).title, @note.title+".jpg")
    @note.download = File.join(current_user.folder_download, "previews", Notebook.find(@note.notebook_id).title, @note.title+".jpg")
    @note.get_preview
    respond_to do |format|
      if @note.save
---
SELECT  `notebooks`.* FROM `notebooks` WHERE `notebooks`.`id` = NULL LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `notes` (`title`, `content`, `user_id`, `notebook_id`, `preview`, `download`, `created_at`, `updated_at`) VALUES ('Nope', ';sjdlsdkblsdbvalkjd', 1, 1, '/var/host/media/removable/Storage/LyBerry/public/uploads/Robert/previews/Marketing/Nope.jpg', '/uploads/Robert/previews/Marketing/Nope.jpg', '2017-01-09 00:06:25', '2017-01-09 00:06:25')

  def destroy
    @note.destroy
---
DELETE FROM `notes` WHERE `notes`.`id` = 1

    def set_note
      @note = Note.find(params[:id])
---
SELECT  `notes`.* FROM `notes` WHERE `notes`.`id` = 1 LIMIT 1