app/controllers/site_controller.rb

  def library
    if logged_in?
      @shelves = Shelf.where("user_id = ?", current_user.id)
      @items = Item.where("user_id = ?", current_user.id)
      @notebooks = Notebook.where("user_id = ?", current_user.id)
      @notes = Note.where("user_id = ?", current_user.id)
---
SELECT `items`.* FROM `items` WHERE (user_id = 1) AND (shelf_id = 1)
SELECT `notebooks`.* FROM `notebooks` WHERE (user_id = 1) AND (shelf_id = 1)
SELECT `notes`.* FROM `notes` WHERE (user_id = 1)