app/controllers/users_controller.rb

  def create

    @user = User.new(user_params)
    @user.folder_path = Rails.root.join('public', 'uploads', @user.name)
    @user.folder_download = '/uploads/'+@user.name
    respond_to do |format|
      if @user.save
        @user.subscribe
        starter_shelf = Shelf.new(title: "My Shelf", description: "Use shelves to organize your library. We made this one for you. Feel free to customize it!", user_id: @user.id )
        starter_shelf.save
---
INSERT INTO `users` (`name`, `last_name`, `email`, `password_digest`, `folder_path`, `folder_download`, `created_at`, `updated_at`) VALUES ('Robert', 'Hosking', 'thedubiouslimabean@hotmail.com', '$2a$10$jk.GFpmTyXu8oCzwMZV38e34T43M1vNDfj1AR1mISHjM5Fr/CD2li', '/var/host/media/removable/Storage/LyBerry/public/uploads/Robert', '/uploads/Robert', '2017-01-08 04:42:24', '2017-01-08 04:42:24')
INSERT INTO `shelves` (`title`, `description`, `user_id`, `created_at`, `updated_at`) VALUES ('My Shelf', 'Use shelves to organize your library. We made this one for you. Feel free to customize it!', 1, '2017-01-07 21:18:36', '2017-01-07 21:18:36')

    def set_user
      @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1